Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/mems.tmx
Source language: ca
Languages: es_es

source: En general, aquestes operacions es poden considerar bàsicament independents del procés de traducció mateix ---com farem en aquest llibre---, però hi ha programes més avançats que són fins i tot capaços d'usar la informació de les etiquetes com a context per a elegir una traducció on hi ha més d'una alternativa.
es_es: En general, estas operaciones se pueden considerar básicamente independientes del propio proceso de traducción ---como haremos en este libro---, pero hay programas más avanzados que son incluso capaces de usar la información de las etiquetas como contexto para elegir una traducción donde hay más de una alternativa.

source: En informàtica, els fitxers d'aquesta mena se solen anomenar normalment bases de dades; les fitxes s'anomenen registres i cada element d'informació de la fitxa s'anomena camp.
es_es: En informática, los ficheros de este tipo se suelen denominar normalmente bases de datos; las fichas se denominan registros y cada elemento de información de la ficha se denomina campo.

source: En l'actualitat el traductor accepta nombroses variants balears i valencianes quan tradueix del català a l'espanyol.
es_es: En la actualidad el traductor acepta numerosas variantes baleares y valencianas cuando traduce del catalán al español.

source: En l'actualitat, les prestacions d'aquest subprograma són molt millorables perquè els corpus de referència actualment en ús no són encara suficientment representatius.
es_es: En la actualidad, las prestaciones de este subprograma son muy mejorables porque los corpus de referencia actualmente en uso no son todavía suficientemente representativos.

source: En molts àmbits la traducció automàtica està encara molt lluny de poder competir en qualitat amb la realitzada per traductors professionals (vegeu el capítol ).
es_es: En muchos ámbitos la traducción automática está todavía muy lejos de poder competir en calidad con la realizada por traductores profesionales (véase el capítulo ).

source: En quina de les tres situacions següents es troba?
es_es: ¿En cuál de las tres situaciones siguientes se encuentra?

source: En resum, hi ha tres modalitats bàsiques d'interacció entre les persones i els programes de traducció automàtica: la preedició (preparació del text abans de la traducció automàtica), la postedició (correcció del text després de la traducció automàtica) i la interacció de la persona amb el sistema de traducció automàtica durant el procés de traducció.
es_es: En resumen, hay tres modalidades básicas de interacción entre las personas y los programas de traducción automática: la preedición (preparación del texto antes de la traducción automática), la postedición (corrección del texto después de la traducción automática) y la interacción de la persona con el sistema de traducción automática durante el proceso de traducción.

source: En una recerca dicotòmica mirem la fitxa que hi ha enmig del fitxer; si ens hem passat, repetim l'operació amb la primera meitat del fitxer, i si ens hem quedat curts, ho fem amb la segona meitat.
es_es: En una búsqueda dicotómica miramos la ficha que hay en medio del fichero; si nos hemos pasado, repetimos la operación con la primera mitad del fichero, y si nos hemos quedado cortos, lo hacemos con la segunda mitad.

source: Encara resta molt a fer amb les altres llengues del món.
es_es: Todavía queda mucho por hacer con las otras lenguas del mundo.

source: Ens ajuda conéixer quins són els mots homògrafs (vegeu la p. ) més comuns de la llengua origen?
es_es: ¿Nos ayuda conocer cuáles son las palabras homógrafas (véase la p. ) más comunes de la lengua origen?

source: Ens els darrers 10 anys, un dels camps amb més investigacions ha estat el de traducció de la parla, una idea que evidentment ha estat present des de fa dècades, però que només ara es pot materialitzar parcialment.
es_es: En los últimos 10 años, uno de los campos con más investigaciones ha sido el de la traducción del habla, una idea que evidentemente ha estado presente desde hace décadas, pero que sólo ahora se puede materializar parcialmente.

source: Entrades compostes pel valor del camp índex i el número de la fitxa (del registre).
es_es: Entradas compuestas por el valor del campo índice y el número de la ficha (del registro).

source: Es duplica.
es_es: Se duplica.

source: Es guarda en un tipus de memòria RAM més ràpida anomenada cache o memòria cau.
es_es: Se guarda en un tipo de memoria RAM más rápida llamada caché .

source: Es poden dir encara més coses sobre la traducció: les traduccions solen estar escrites en un subllenguatge particular (registre, especialitat...) de la comunitat lingüística de la LM, basat en un subllenguatge paral·lel de la LO; els documents i les traduccions corresponents es poden classificar en tipus i aquesta tipologia afecta la traducció; la traducció es veu afectada per elements extralingüístics perquè, normalment, els documents són entitats que uneixen l'expressió lingüística amb l'expressió no lingüística; les traduccions tenen un receptor o lector; una traducció, com a acte comunicatiu ha de considerar, a més de la intenció de la traducció, les expectatives dels lectors, que resulten del seu rerefons cultural i de les seues necessitats comunicatives, i que influeixen en la recepció del text traduït; la traducció sempre té una motivació: la superació de barreres comunicatives; per això se n'ha creat una professió.
es_es: Se pueden decir todavía más cosas sobre la traducción: las traducciones suelen estar escritas en un sublenguaje particular (registro, especialidad...) de la comunidad lingüística de la LM, basado en un sublenguaje paralelo de la LO; los documentos y las traducciones correspondientes se pueden clasificar en tipos y esta tipología afecta la traducción; la traducción se ve afectada por elementos extralingüísticos porque, normalmente, los documentos son entidades que unen la expresión lingüística con la expresión no lingüística; las traducciones tienen un receptor o lector; una traducción, como acto comunicativo tiene que considerar, además de la intención de la traducción, las expectativas de los lectores, que resultan de su trasfondo cultural y de sus necesidades comunicativas, y que influyen en la recepción del texto traducido; la traducción siempre tiene una motivación: la superación de barreras comunicativas; por eso se ha creado una profesión.

source: Es pot aprofundir un poc més en la definició de traducció que hem considerat més amunt, revisant definicions existents (algunes preses de {sager93b}): [p. 19]{nida59b}: ``La traducció consisteix a produir en la llengua meta l'equivalent natural més proper del missatge en la llengua origen, primerament quant al significat i segonament quant a l'estil.'' Sager diu que, més que natural (en sentit absolut) caldria dir adequat (a la tasca concreta).
es_es: Se puede profundizar un poco más en la definición de traducción que hemos considerado más arriba, revisando definiciones existentes (algunas presas de {sager93b}): [p. 19]{nida59b}: ``La traducción consiste en producir en la lengua meta el equivalente natural más cercano del mensaje en la lengua origen, en primer lugar en cuanto al significado y, en segundo lugar, en cuanto al estilo.'' Sager dice que, más que natural (en sentido absoluto) habría que decir adecuado (a la tarea concreta).

source: Es pot construir un índex per a cada un dels camps associats a les consultes més freqüents i així s'evita recórrer tota la base de dades cada vegada que es fa una consulta: es busca el valor del camp en el registre corresponent i, quan es troba, s'usa la posició del registre per a accedir-hi directament.
es_es: Se puede construir un índice para cada uno de los campos asociados a las consultas más frecuentes y así se evita recorrer toda la base de datos cada vez que se hace una consulta: se busca el valor del campo en el registro correspondiente y, cuando se encuentra, se usa la posición del registro para acceder directamente.

source: Es pot demostrar que la recerca dicotòmica mira com a molt $n$ fitxes si el fitxer té entre $2^{n-1}$ i $2^n$ fitxes, perquè després de cada consulta es redueix a la meitat la grandària del fitxer que cal explorar; per exemple, si el fitxer té 1234 fitxes, hi ha prou amb $n=11$ recerques perquè $2^{10}=1024$ i $2^{11}=2048$.
es_es: Se puede demostrar que la búsqueda dicotómica mira como mucho $n$ fichas si el fichero tiene entre $2^{n-1}$ y $2^n$ fichas, porque después de cada consulta se reduce a la mitad el tamaño del fichero que hay que explorar; por ejemplo, si el fichero tiene 1234 fichas, hay bastante con $n=11$ búsquedas porque $2^{10}=1024$ y $2^{11}=2048$.

source: Es refereixen al mateix concepte.
es_es: Se refieren al mismo concepto.

source: Es tracta bàsicament d'un sistema per transferència, indicat per a la traducció de documents relacionats amb el processament de dades i les telecomunicacions.
es_es: Se trata básicamente de un sistema por transferencia, indicado para la traducción de documentos relacionados con el procesamiento de datos y las telecomunicaciones.

source: Es va traduir a l'anglés un conjunt de 49 frases en rus usant un diccionari de només 250 mots i 6 regles gramaticals.
es_es: Se tradujo al inglés un conjunto de 49 frases en ruso usando un diccionario de sólo 250 palabras y 6 reglas gramaticales.

source: Es-Ca, de Incyta
es_es: Bases de datos

source: Eurotra és un dels projectes de traducció més coneguts del decenni dels 80.
es_es: Eurotra es uno de los proyectos de traducción más conocidos de los 80.

source: Experiències de TA espanyol--català
es_es: Experiencias de TA español--catalán

source: Facilitat de postedició de la traducció en brut.
es_es: Facilidad de postedición de la traducción en bruto.

source: Finalment, hem de tenir en compte que tot i que la persona posteditora coneix la llengua meta i converteix el text en brut a una forma genuïna en aquesta llengua, qui siga un veritable especialista en postedició, a més, també coneix el sistema de traducció automàtica i quins en són els errors més típics; així, la tasca de postedició és molt més eficient, ja que en conéixer l'origen i la causa dels errors se'n fa més fàcil i ràpida la correcció.
es_es: Finalmente, tenemos que tener en cuenta que a pesar de que la persona posteditora conoce la lengua meta y convierte el texto bruto en una forma genuina en esta lengua, quien sea un verdadero especialista en postedición, además, también conoce el sistema de traducción automática y cuáles son los errores más típicos; así, la tarea de postedición es mucho más eficiente, puesto que al conocer el origen y la causa de los errores se hace más fácil y rápida la corrección.

source: Heus ací un exemple de document TBX: <?xml version='1.0'?> <!DOCTYPE martif SYSTEM "./TBXcoreStructureDTD-v-1-0.DTD"> <martif type='TBX' xml:lang='en' > <martifHeader> <fileDesc> <sourceDesc> <p>from an Oracle corporation termBase</p> </sourceDesc> </fileDesc> <encodingDesc> <p type='DCSName'>TBXdefaultXCS-v-1-0.XML</p> </encodingDesc> </martifHeader> <text> <body> <termEntry id='eid-Oracle-67'> <descrip type='subjectField'> manufacturing </descrip> <descrip type='definition'> A value between 0 and 1 used in ... </descrip> <langSet xml:lang='en'> <tig> <term tid='tid-Oracle-67-en1'> alpha smoothing factor </term> <termNote type='termType'> fullForm </termNote> </tig> </langSet> <langSet xml:lang='hu'> <tig> <term tid='tid-Oracle-67-hu1'> Alfa sim
es_es: He aquí un ejemplo de documento TBX: <?xml version='1.0'?> <!DOCTYPE martif SYSTEM "./TBXcoreStructureDTD-v-1-0.DTD"> <martif type='TBX' xml:lang='en' > <martifHeader> <fileDesc> <sourceDesc> <p>from an Oracle corporation termBase</p> </sourceDesc> </fileDesc> <encodingDesc> <p type='DCSName'>TBXdefaultXCS-v-1-0.XML</p> </encodingDesc> </martifHeader> <text> <body> <termEntry id='eid-Oracle-67'> <descrip type='subjectField'> manufacturing </descrip> <descrip type='definition'> A value between 0 and 1 used in ... </descrip> <langSet xml:lang='en'> <tig> <term tid='tid-Oracle-67-en1'> alpha smoothing factor </term> <termNote type='termType'> fullForm </termNote> </tig> </langSet> <langSet xml:lang='hu'> <tig> <term tid='tid-Oracle-67-hu1'> Alfa sim

source: Història de la traducció automàtica
es_es: Historia de la traducción automática

source: Imaginem, en primer lloc, que volem buscar l'element ``Garrido''.
es_es: Imaginemos, en primer lugar, que queremos buscar el elemento ``Garrido''.

source: Imagineu que podem elegir entre dos sistemes de traducció automàtica diferent $t_A$ i $t_B$ per a traduir manuals de televisors de l'anglés al francés, i que s'ha de dissenyar un anglés controlat per a minimitzar la postedició.
es_es: Imaginad que podemos elegir entre dos sistemas de traducción automática diferente $t_A$ y $t_B$ para traducir manuales de televisores del inglés al francés, y que se tiene que diseñar un inglés controlado para minimizar la postedición.

source: Imagineu que tenim un sistema de traducció automàtica que ens costa uns 0,03 euros per mot traduït i que produeix un 10% de mots incorrectes en les traduccions.
es_es: Imaginad que tenemos un sistema de traducción automática que nos cuesta unos 0,03 euros por palabra traducida y que produce un 10% de palabras incorrectas en las traducciones.

source: Imagineu que un traductor professional cobra 0,05 euros per mot de text traduït i que un corrector de textos cobra 0,10 euros per mot de text corregit.
es_es: Imaginad que un traductor profesional cobra 0,05 euros por palabra de texto traducido y que un corrector de textos cobra 0,10 euros por palabra de texto corregido.

source: Indica en quina d'aquestes situacions de traducció automàtica és menys crucial la perfecció lingüística de la traducció.
es_es: Indica en cuál de estas situaciones de traducción automática es menos crucial la perfección lingüística de la traducción.

source: Indica quina d'aquestes situacions de traducció automàtica és d'assimilació d'informació: Narcís usa el programa traductor de l'anglés a l'espanyol Spanish Assistant per a llegir els documents electrònics que troba en Internet sobre la influència de l'èuscar sobre el gascó.
es_es: Indica cuál de estas situaciones de traducción automática es de asimilación de información: Narciso usa el programa traductor del inglés al español Spanish Assistant para leer los documentos electrónicos que encuentra en Internet sobre la influencia del vasco sobre el gascón.

source: Inicialment, la disponibilitat del programa va ser més aviat reduïda; actualment es pot descarregar gratuïtament de diversos servidors d'Internet (per exemple, {http://www.edu.gva.es/polin/val/salt/apolin_salt.htm} o {www.softcatala.org}) i també el distribueixen els serveis de normalització lingüística d'algunes universitats.
es_es: Inicialmente, la disponibilidad del programa fue más bien reducida; actualmente se puede descargar gratuitamente de varios servidores de Internet (por ejemplo, {http://www.edu.gva.es/polin/val/salt/apolin_salt.htm} o {www.softcatala.org}) y también lo distribuyen los servicios de normalización lingüística de algunas universidades.

source: Inicialment, mirem l'element d'enmig (el 13) de la llista sencera (la llista que inclou els elements de l'1 al 25) i hi trobem ``Larrañaga''; com que ens hem passat, ens quedem amb la meitat baixa de la llista (que inclou els elements de l'1 al 12) oblidant-nos de l'altra meitat.
es_es: Inicialmente, miramos el elemento de en medio (el 13) de la lista entera (la lista que incluye los elementos del 1 al 25) y encontramos ``Larrañaga''; como nos hemos pasado, nos quedamos con la primera mitad de la lista (que incluye los elementos del 1 al 12) olvidándonos de la otra mitad.

source: L'screening es pot fer usant un ordinador personal tot sol, o accedint a ordinadors servidors d'informació, en el cas de grans instal·lacions.
es_es: El screening se puede hacer usando un ordenador personal, o accediendo a ordenadores servidores de información, en el caso de grandes instalaciones.

source: L'Acadèmia Valenciana de la Llengua ha declarat oficials ``els continguts'' del programa SALT 2 (acord de 20 de maig del 2002).
es_es: La Academia Valenciana de la Lengua ha declarado oficiales "los contenidos'' del programa SALT 2 (acuerdo de 20 de mayo de 2002).

source: L'URI per a més informació és {http://www.lisa.org/tbx/
es_es: La URI para más información es {http://www.lisa.org/tbx/

source: L'adopció d'un llenguatge controlat en una situació de traducció de documents d'una llengua a moltes llengües per a la disseminació és, en el procés complet, una alternativa a{} {}la postedició repetitiva dels documents meta.
es_es: La adopción de un lenguaje controlado en una situación de traducción de documentos de una lengua a muchas lenguas para la diseminación es, en el proceso completo, una alternativa a la{} {}postedición repetitiva de los documentos meta.

source: L'entrada són les formes superficials del text i la sortida, formes lèxiques consistents en lema, categoria lèxica i informació de flexió.
es_es: La entrada son las formas superficiales del texto y la salida, formas léxicas consistentes en lema, categoría léxica e información de flexión.

source: L'entrada és la forma lèxica de la LO i la sortida, la forma lèxica corresponent en la llengua meta (LM).
es_es: La entrada es la forma léxica de la LO y la salida, la forma léxica correspondiente en la lengua meta (LM).

source: L'entusiasme va fer que es finançaren un munt de projectes entre la meitat dels 50 i la meitat dels 60, projectes dins els quals van nàixer la major part de les tècniques actuals, com ara la traducció indirecta per transferència o la traducció per interlingua (vegeu el capítol ).
es_es: El entusiasmo hizo que se financiaran un montón de proyectos desde la mitad de los 50 hasta la mitad de los 60, proyectos dentro de los cuales nacieron la mayor parte de las técnicas actuales, como por ejemplo la traducción indirecta por transferencia o la traducción por interlingua (véase el capítulo ).

source: L'escriptor de llenguatges controlats usa normalment un editor de textos intel·ligent que fa les següents tasques: Comprovar el compliment de les restriccions terminològiques (per a això, pot ser útil accedir a una base de dades terminològica, com les esmentades en el capítol ), sintàctiques (fent l'anàlisi sintàctica ---vegeu la secció --- i resolent les ambigüitats que hi apareguen), semàntiques i d'estil (per exemple, restringint el format de les dades).
es_es: El escritor de lenguajes controlados usa normalmente un editor de textos inteligente que hace las siguientes tareas: Comprobar el cumplimiento de las restricciones terminológicas (para lo cual, puede ser útil acceder a una base de datos terminológica, como las mencionadas en el capítulo ), sintácticas (haciendo el análisis sintáctico ---véase la sección --- y resolviendo las ambigüedades que aparezcan), semánticas y de estilo (por ejemplo, restringiendo el formato de los datos).

source: L'informe assegurava que la TA era més lenta i menys exacta que la feta pels humans, a més de ser el doble de cara, i que no hi havia cap indici de l'obtenció en el futur més o menys inmediat d'un sistema de TA útil.
es_es: El informe aseguraba que la TA era más lenta y menos exacta que la hecha por los humanos, además de ser el doble de cara, y que no había ningún indicio de obtener, en un futuro más o menos inmediato, un sistema de TA útil.

source: L'informe va acabar quasi virtualment amb la recerca en TA als Estats Units (també va tenir un impacte negatiu en els projectes desenvolupats a la resta del món) i durant molts anys la TA va ser percebuda com un autèntic fracàs.
es_es: El informe estuvo a punto de acabar con la investigación en TA en los Estados Unidos (también tuvo un impacto negativo en los proyectos desarrollados en el resto del mundo) y durante muchos años la TA fue percibida como un auténtico fracaso.

source: L'informe va fer que es reduira significativament el nombre de persones que es dedicaven a la TA i que els laboratoris començaren a treballar en el que es va conéixer com a lingüística computacional.
es_es: El informe hizo que se redujera significativamente el número de personas que se dedicaban a la TA y que los laboratorios empezaran a trabajar en lo que se conoció como lingüística computacional.

source: L'objectiu era el desenvolupament de sistemes perfectes.
es_es: El objetivo era el desarrollo de sistemas perfectos.

source: L'objectiu no és obtenir un sistema de traducció perfecta, sinó un sistema adequat per a aplicacions amb llenguatges, dominis i usuaris restringits.
es_es: El objetivo no es obtener un sistema de traducción perfecta, sino un sistema adecuado para aplicaciones con lenguajes, dominios y usuarios restringidos.

source: L'organització de la informació en forma de base de dades simplifica enormement les consultes, ja que els ordinadors són molt més ràpids i segurs a l'hora de, per exemple, comparar el contingut d'un determinat camp de totes les fitxes amb un cert valor o patró (per exemple, els autors que comencen per Per) i llistar el contingut d'un altre camp (per exemple, el títol) per a cada fitxa coincident.
es_es: La organización de la información en forma de base de datos simplifica enormemente las consultas, puesto que los ordenadores son mucho más rápidos y seguros a la hora de, por ejemplo, comparar el contenido de un determinado campo de todas las fichas con un cierto valor o patrón (por ejemplo, los autores que empiezan por Por) y listar el contenido de otro campo (por ejemplo, el título) para cada ficha coincidente.

source: L'ús d'un llenguatge controlat L'ús d'un sistema d'interlingua.
es_es: El uso de un lenguaje controlado El uso de un sistema de interlingua.

source: La Acadèmia Nacional de les Ciències dels Estats Units va publicar el 1966 l'informe ALPAC (Automatic Language Processing Advisory Committee) en el qual es recomanava que els nombrosos recursos que es dedicaven a la recerca en TA s'utilitzaren per tasques menys pretensioses i més bàsiques relacionades amb el processament del llenguatge natural i amb el desenvolupament d'eines de suport per als traductors com ara diccionaris automàtics.
es_es: La Academia Nacional de las Ciencias de los Estados Unidos publicó en 1966 el informe ALPAC (Automatic Language Processing Advisory Committee) en el cual se recomendaba que los numerosos recursos que se dedicaban a la investigación en TA se utilizaran para tareas menos pretenciosas y más básicas relacionadas con el procesamiento del lenguaje natural y con el desarrollo de herramientas de apoyo para los traductores como por ejemplo diccionarios automáticos.

source: La CAM ha encarregat també el disseny d'un espanyol controlat per a textos financers i dels assistents d'estil corresponents per als autors.
es_es: La CAM ha encargado también el diseño de un lenguaje en español controlado para textos financieros y de los asistentes de estilo correspondientes para los autores.

source: La TA i les eines de suport a la traducció son cada vegada més usades per les grans empreses i per les administracions, principalment per a la traducció de documentació tècnica.
es_es: La TA y las herramientas de apoyo a la traducción son cada vez más usadas por las grandes empresas y por las administraciones, principalmente para la traducción de documentación técnica.

source: La combinació d'algunes d'aquestes eines en un programari concret és el que es coneix com estacions de treball per a traductors (per exemple, el Translation Manager d'IBM o el Translator Workbench de Trados).
es_es: La combinación de algunas de estas herramientas en un software concreto es lo que se conoce como estaciones de trabajo para traductores (por ejemplo, el Translation Manager de IBM o el Translator Workbench de Trados).
